In [ ]:
# ! pip install watermark    
      # ! => OS상의 명령을 주피터에서 실행하고자 할 때 사용함

In [5]:
%load_ext watermark
%watermark -v -p numpy,scipy,sklearn,pandas,matplotlib

The watermark extension is already loaded. To reload it, use:
  %reload_ext watermark
CPython 3.7.3
IPython 7.6.1

numpy 1.18.0
scipy 1.5.0
sklearn 0.0
pandas 0.25.1
matplotlib 3.1.2

- WatgerMark에 대하여 
  - 관련문서 : https://pinkwink.kr/1235  
  - VaterMark를 사용하여 모듈의 설치된 버젼을 확인할 수가 있다.

In [8]:
! pip freeze     # 내 파이썬 설치된 환경의 모듈을 조사

absl-py==0.7.1
appdirs==1.4.3
asn1crypto==1.3.0
astor==0.8.0
attrs==19.1.0
backcall==0.1.0
beautifulsoup4==4.8.0
bleach==3.1.0
boto==2.49.0
boto3==1.10.46
botocore==1.13.46
cachetools==4.0.0
certifi==2020.6.20
cffi==1.12.3
chardet==3.0.4
colorama==0.4.1
cryptography==2.7
cycler==0.10.0
decorator==4.4.0
defusedxml==0.6.0
docutils==0.15.2
entrypoints==0.3
gast==0.2.2
gensim==3.8.1
google-auth==1.10.0
google-auth-oauthlib==0.4.1
google-pasta==0.1.8
graphviz==0.13.2
grpcio==1.16.1
h5py==2.9.0
html5lib==1.0.1
idna==2.8
imageio==2.6.1
ipykernel==5.1.1
ipython==7.6.1
ipython-genutils==0.2.0
ipywidgets==7.5.0
jedi==0.13.3
Jinja2==2.10.1
jmespath==0.9.4
joblib==0.13.2
JPype1==0.7.0
jsonschema==3.0.1
jupyter==1.0.0
jupyter-client==5.3.1
jupyter-console==6.0.0
jupyter-core==4.5.0
Keras==2.2.4
Keras-Applications==1.0.8
Keras-Preprocessing==1.1.0
kiwisolver==1.1.0
konlpy==0.5.1
lxml==4.4.1
Mako==1.1.0
Markdown==3.1.1
MarkupSafe==1.1.1
matplotlib==3.1.2
mecab==0.996
mglearn==0.1.7
mistune==0.8.4
mkl-fft==1.0.12
mkl-random==1.0.2
mkl-service==2.0.2
nbconvert==5.5.0
nbformat==4.4.0
nltk==3.4.5
notebook==6.0.0
numpy==1.18.0
oauthlib==3.1.0
opt-einsum==3.1.0
pandas==0.25.1
pandocfilters==1.4.2
parso==0.5.0
patsy==0.5.1
pickleshare==0.7.5
Pillow==6.2.1
prometheus-client==0.7.1
prompt-toolkit==2.0.9
protobuf==3.8.0
pyasn1==0.4.8
pyasn1-modules==0.2.7
pycparser==2.19
Pygments==2.4.2
pygpu==0.7.6
pyOpenSSL==19.0.0
pyparsing==2.4.0
pyreadline==2.1
pyrsistent==0.14.11
PySocks==1.7.1
python-dateutil==2.8.0
pytz==2019.1
pywinpty==0.5.5
PyYAML==5.1.2
pyzmq==18.0.0
qtconsole==4.5.2
requests==2.22.0
requests-oauthlib==1.3.0
rsa==4.0
s3transfer==0.2.1
scikit-learn==0.21.3
scipy==1.5.0
seaborn==0.10.1
selenium==3.141.0
Send2Trash==1.5.0
six==1.12.0
sklearn==0.0
smart-open==1.9.0
soupsieve==1.9.2
statsmodels==0.10.1
tb-nightly==1.15.0a20190806
tensorboard==2.0.2
tensorflow==1.14.0
tensorflow-estimator==2.0.1
tensorflow-gpu==2.0.0rc1
termcolor==1.1.0
terminado==0.8.2
testpath==0.4.2
tf-estimator-nightly==1.14.0.dev2019080601
Theano==1.0.4
torch==1.0.1
tornado==6.0.3
tqdm==4.46.0
traitlets==4.3.2
uritools==2.2.0
urlextract==0.14.0
urllib3==1.25.8
vocab==0.0.4
watermark==2.0.1
wcwidth==0.1.7
webencodings==0.5.1
Werkzeug==0.15.5
widgetsnbextension==3.5.0
win-inet-pton==1.1.0
wincertstore==0.2
wordcloud==1.6.0
wrapt==1.11.2
xlrd==1.2.0

WARNING: Could not generate requirement for distribution -ensorflow-gpu 2.0.0 (c:\users\leesd\appdata\roaming\python\python37\site-packages): Parse error at "'-ensorfl'": Expected W:(abcd...)
WARNING: Could not generate requirement for distribution -umpy 1.16.4 (c:\cosmos\anaconda3\envs\pyenv3\lib\site-packages): Parse error at "'-umpy==1'": Expected W:(abcd...)
WARNING: Could not generate requirement for distribution -atplotlib 3.1.0 (c:\cosmos\anaconda3\envs\pyenv3\lib\site-packages): Parse error at "'-atplotl'": Expected W:(abcd...)

In [9]:
import pandas as pd

## 예제 2-1 시리즈 멤버 알아보기

#### 학습목표 
- 판다스의 주요 클래스인 시리즈와 데이터프레임의 인스턴스를 생성해 본다.  
- 이어서 내부 속성을 확인하고 어떤 자료들을 관리하는 지 알아본다.  
- 그후, 시리즈와 데이터프레임을 생성하고 
  - 행과 열로 검색 및 슬라이싱을 처리해 내부 원소나 부분집합을 가져오는 방법을 살펴본다.  
  - 인덱서를 이용해 검색과 슬라이싱들을 혼합해서 다양한 검색을 처리해 본다.

#### 시리즈에 대하여 
- 시리즈는 
  - 보통의 배열과 달리 인덱스에 추가적인 레이블을 붙여 사용할 수 있는 구조이다.  
  - 문자열이나 날짜들을 레이블로 붙여서 사용할 수 있으므로 특정 이름으로 검색이 가능하다.  
- 일반적인 파이썬의 리스트보다는 딕셔너리(dict) 자료형과 비슷한 구조이다. 
  - 다만 딕셔너리와 다른 점은 시리즈를 구성하는 모든 값이 단일 자료형으로 처리가 된다.  
  
#### 시리즈의 구성 
- 판다스에서 제공되는 1차원 배열이다.  
- 판다스에 있는 데이터프레임등 다차원 배열의 원소로 구성되는 기본적인 클래스이다.

#### Series 문장형식 
- 문장형식 : 
  - class pandas.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)[source]
  
 
- One-dimensional ndarray with axis labels (including time series).
- Labels need not be unique but must be a hashable type. 
- The object supports both integer- and label-based indexing and provides a host of methods for performing operations involving the index. 
- Statistical methods from ndarray have been overridden to automatically exclude missing data (currently represented as NaN).


- Operations between Series (+, -, /, , *) align values based on their associated index values– they need not be the same length. 
- The result index will be the sorted union of the two indexes.


- Parameters
  - dataarray-like, Iterable, dict, or scalar value
  - Contains data stored in Series.

- Changed in version 0.23.0: 
  - If data is a dict, argument order is maintained for Python 3.6 and later.

- indexarray-like or Index (1d)
  - Values must be hashable and have the same length as data. Non-unique index values are allowed. 
  - Will default to RangeIndex (0, 1, 2, …, n) if not provided. If both a dict and index sequence are used, the index will override the keys found in the dict.


- dtypestr, numpy.dtype, or ExtensionDtype, optional
  - Data type for the output Series. If not specified, this will be inferred from data. See the user guide for more usages.

- namestr, optional
  - The name to give to the Series.

- copybool, default False
  - Copy input data.

In [22]:
sr = pd.Series([1,2,3,4],index=list('abcd'),name="SR1") 
sr

a    1
b    2
c    3
d    4
Name: SR1, dtype: int64

In [23]:
sr.name

'SR1'

In [24]:
sr.dtype

dtype('int64')

In [25]:
sr.shape         # element가 4개인 1차원 배열로 생성되었슴을 확인

(4,)

In [26]:
sr.ndim

1

In [27]:
sr.size

4

In [28]:
sr.strides      # 향후 버젼에서는 정리되었슴

C:\COSMOS\Anaconda3\envs\pyenv3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Series.strides is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

(8,)

In [29]:
sr.index

Index(['a', 'b', 'c', 'd'], dtype='object')

## 2.1.2 데이터 프레임 
- 교재 P42 참고

### 데이터 프레임에 대하여 
- 판다스는 1차원 시리즈를 가지고 2차원 배열인 데이터 프레임을 관리한다.  
- 데이터 프레임의 구성은 
  - 열(Column)을 기반으로 관리하므로 1차원 배열인 시리즈가 열(Column)단위로 저장된다.  
  - 시리즈와의 차이점은 
    - 일차적으로 차원이 확대되었고 
    - 각 차원에 대한 원소가 시리즈로 들어온다는 것이다.  
- 데이터 프레임 구조와 가장 비슷한 것은 
  - 파이썬의 자료형인 딕셔너리(dict) 내부에 딕셔너리(dict)로 구성된 구조처럼 사용된다.  
  - 딕셔너리의 첫번째 키는 컬럼의 이름으로 들어가고 
    - 실제 값은 내부의 딕셔너리 값이 들어간다.

### 데이터 프레임의 구성 
- 데이터 프레임은 두 개의 인덱스(index, column속성)로 들어간다.  
- 생성할 때 들어가는 데이터는 
  - .values 속성에 들어가서 
  - 인덱스를 이용해서 조회되는 구조이다.

## 예제 2-2 데이터프레임 멤버 알아보기

In [30]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8]],index=['a','b'],
                  columns=['c1','c2','c3','c4'])
df

   c1  c2  c3  c4
a   1   2   3   4
b   5   6   7   8

In [31]:
df.shape

(2, 4)

In [32]:
df.ndim

2

In [33]:
df.size

8

- 데이터 프레임은 2차원 레이블의 속성인 행(.index)과 열(.columns)의 속성을 확인하면 
  - .index 클래스의 객체로 저장된다.  
  - .index 클래스를 별도로 제공해서 인덱스 레이블을 관리한다.

In [34]:
df.index

Index(['a', 'b'], dtype='object')

In [35]:
df.columns

Index(['c1', 'c2', 'c3', 'c4'], dtype='object')

In [36]:
df.info()       # Data Frame의 종합적인 정보를 확인할 때에 이렇게 사용한다.

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, a to b
Data columns (total 4 columns):
c1    2 non-null int64
c2    2 non-null int64
c3    2 non-null int64
c4    2 non-null int64
dtypes: int64(4)
memory usage: 80.0+ bytes

- 각 열(Column)에 저장된 정보와 전체 메모리에 대한 정보도 함께 표시 됨을 알 수가 있다.

## 예제 2-3 시리즈와 데이터프레임의 다양한 멤버 확인하기

- 교재 P45 
- 시리즈와 데이터 프레임의 멤버 비교 
  - 파이썬에 있는 dir함수는 
  - 시리즈와 데이터 프레임 클래스의 멤버를 볼 수가 있다.  
  - 이를 이용해서 내부 멤버를 확인한다.

In [38]:
s = set([ i for i in dir(pd.Series) if not i.startswith("_")])
s     # Series를 사용하여 줄 수 있는 메소드를 확인

{'T',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'as_blocks',
 'as_matrix',
 'asfreq',
 'asobject',
 'asof',
 'astype',
 'at',
 'at_time',
 'autocorr',
 'axes',
 'base',
 'between',
 'between_time',
 'bfill',
 'blocks',
 'bool',
 'cat',
 'clip',
 'clip_lower',
 'clip_upper',
 'combine',
 'combine_first',
 'compound',
 'compress',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'data',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dt',
 'dtype',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'explode',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'from_array',
 'ftype',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_value',
 'get_values',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'imag',
 'index',
 'infer_objects',
 'interpolate',
 'is_copy',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'itemsize',
 'iteritems',
 'ix',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'nonzero',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'ptp',
 'put',
 'quantile',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'rdivmod',
 'real',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'sem',
 'set_axis',
 'set_value',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'sparse',
 'squeeze',
 'std',
 'str',
 'strides',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_list',
 'to_msgpack',
 'to_numpy',
 'to_period',
 'to_pickle',
 'to_sparse',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'tolist',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'valid',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs'}

In [39]:
d = set([ i for i in dir(pd.DataFrame) if not i.startswith("_")])
d     # dataframe에서 줄 수 있는 메소드를 확인

{'T',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'as_blocks',
 'as_matrix',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'axes',
 'between_time',
 'bfill',
 'blocks',
 'bool',
 'boxplot',
 'clip',
 'clip_lower',
 'clip_upper',
 'columns',
 'combine',
 'combine_first',
 'compound',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_dict',
 'from_items',
 'from_records',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_value',
 'get_values',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'is_copy',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'ix',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_index',
 'set_value',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'sparse',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_msgpack',
 'to_numpy',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sparse',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs'}

- 아래 예제는 
  - 시리즈를 기준으로 데이터 프레임과 공통된 것을 제거한(뺀) 시리즈만 있는 것을 추출한다.  
  - 추출할 때에 집합연산의 차집합(마이너스 기호) 연산을 통하여 
    - 새로운 부분집합을 만들어서 
    - 내부의 문자열을 출력하면 시리즈에만 있는 멤버들을 출력할 수가 있다.

In [41]:
count = 0       # 시리즈에만 줄 수 있는 메소드를 검사 
for i in (s - d ) :
    count += 1
    print(i, end=",  ") 
    if (count % 7 == 0) :   # 한 줄에 7개씩 보여주도록 한다.  
        print()

map,  nonzero,  value_counts,  real,  str,  ptp,  dt,
ftype,  rdivmod,  nbytes,  tolist,  array,  flags,  name,
view,  asobject,  searchsorted,  divmod,  is_monotonic_increasing,  hasnans,  compress,
is_monotonic,  factorize,  valid,  argmin,  repeat,  cat,  strides,
put,  base,  between,  from_array,  ravel,  is_monotonic_decreasing,  imag,
data,  is_unique,  unique,  autocorr,  dtype,  argsort,  item,
to_list,  argmax,  itemsize,  to_frame,

In [42]:
count = 0     # dataframe에만 줄 수 있는 메소드를 검사 
for i in (d - s ) :
    count += 1
    print(i, end=",  ") 
    if (count % 7 == 0) :
        print()

to_feather,  to_gbq,  itertuples,  pivot,  melt,  from_dict,  eval,
columns,  assign,  lookup,  insert,  to_html,  to_stata,  pivot_table,
select_dtypes,  from_items,  stack,  from_records,  join,  query,  style,
to_parquet,  to_records,  merge,  set_index,  corrwith,  info,  boxplot,
iterrows,  applymap,

In [43]:
count = 0              # Series, dataframe 모두 사용할 수가 있는 메소드를 검사 
for i in (d & s ) :    # 두 개에 모두 포함된 속성을 구별해 낸다.  
    count += 1
    print(i, end=",  ") 
    if (count % 7 == 0) :
        print()

bfill,  size,  equals,  corr,  rename,  get_dtype_counts,  swaplevel,
fillna,  transpose,  cumsum,  first,  reset_index,  compound,  shape,
add_prefix,  empty,  combine_first,  std,  isin,  prod,  head,
last,  rtruediv,  iat,  ndim,  idxmax,  drop_duplicates,  shift,
dot,  sub,  iteritems,  max,  transform,  rolling,  combine,
dropna,  radd,  to_dense,  axes,  cov,  add_suffix,  mask,
clip_upper,  to_sparse,  product,  nunique,  slice_shift,  unstack,  to_excel,
cumprod,  get_values,  asfreq,  pow,  count,  to_sql,  agg,
cummax,  last_valid_index,  mode,  as_blocks,  clip_lower,  tail,  median,
sort_values,  get,  ne,  apply,  clip,  bool,  get_value,
reorder_levels,  between_time,  divide,  kurt,  is_copy,  dtypes,  to_hdf,
to_timestamp,  to_csv,  expanding,  gt,  lt,  get_ftype_counts,  ix,
skew,  describe,  plot,  notna,  where,  filter,  to_period,
idxmin,  any,  items,  sum,  var,  kurtosis,  diff,
mean,  swapaxes,  multiply,  mul,  rpow,  interpolate,  T,
nsmallest,  sample,  to_string,  values,  ftypes,  rsub,  at_time,
eq,  le,  round,  pct_change,  rmul,  to_msgpack,  to_xarray,
rename_axis,  set_axis,  isnull,  to_numpy,  loc,  as_matrix,  sparse,
ffill,  isna,  cummin,  to_pickle,  groupby,  mod,  abs,
asof,  align,  rfloordiv,  reindex_like,  set_value,  resample,  truncate,
sort_index,  notnull,  copy,  to_clipboard,  nlargest,  tz_localize,  to_json,
to_dict,  rdiv,  tz_convert,  quantile,  mad,  all,  truediv,
explode,  tshift,  min,  iloc,  ewm,  update,  rank,
infer_objects,  memory_usage,  add,  append,  rmod,  floordiv,  pop,
at,  aggregate,  first_valid_index,  blocks,  index,  div,  astype,
reindex,  subtract,  sem,  squeeze,  duplicated,  to_latex,  pipe,
take,  droplevel,  keys,  xs,  drop,  ge,  replace,
hist,

## 예제 2-4 파일에 저장된 멤버 정보를 읽어와서 확인하기

- 클래스의 속성과 같은 정보를 
  - 하나의 csv로 만들어서 판다스의 함수 들을 이용해 처리하는 방법을 알아보자.  
  - 일단 판다스에서 제공하는 csv 파일을 읽는 read_csv함수를 활용해서 
  - 데이터를 읽어서 데이터프레임을 생성한다.  
  - 이 때 각 컬럼에 대한 정보를 .usecols 매개변수를 이용해서 처리한다.

- 또한 파일에 저장된 텍스트를 utf-8을 기준으로 변환해야 
  - 인코딩 매개변수에 대한 변환기준인 euc-kr로 인코딩한다.  
  - 저장된 df_f 변수에 데이터 프레임이 할당되어 있으므로 
    - .head 메소드로 내부의 값을 조회한다.

In [302]:
df_f = pd.read_csv('../data/series_dataframe.csv', 
                   usecols=['Member','Series','DataFrame'],
                   encoding='euc-kr')

In [303]:
df_f.head()

       Member      Series   DataFrame
0           T           T           T
1         abs         abs         abs
2         add         add         add
3  add_prefix  add_prefix  add_prefix
4  add_suffix  add_suffix  add_suffix

In [304]:
df_f.shape

(264, 3)

In [305]:
df_f['Series'].head()

0             T
1           abs
2           add
3    add_prefix
4    add_suffix
Name: Series, dtype: object

- 시리즈와 데이터프레임 안에 264개의 속성과 멤버가 동일하게 구성되지 않아 빈칸으로 채워졌다. 
- 이런 누락값을 확인하려면 .isnull 메소드로 시리즈의 각 행의 값을 True와 False로 표시한다.

In [306]:
df_f['Series'].isnull().sum()

29

In [307]:
df_f['DataFrame'].isnull().sum()

41

In [308]:
(df_f['Member'] == df_f['Series']).head()

0    True
1    True
2    True
3    True
4    True
dtype: bool

- 두 컬럼의 인덱싱 연산자를 통해 읽어와서 비교 연산자를 실행하면 
  - 같은 이름은 True로 표시되고 
  - 같지 않은 이름은 False로 표시하므로 
  - 공통된 것은 .sum 메소드로 계산하면 건수를 구할 수가 있다.   
- 일단 비교연산자의 처리된 결과가 새로운 시리즈로 나오고 그 내부의 값이 True나 False로 처리된다.

## 예제 2-5 : 리스트로 시리즈 생성

#### 시리즈의 생성자 
- 시리즈의 생성자는 data, index, dtype, copy 4개의 매개변수를 받는다.  
- 기본적으로 데이터는 리스트나 딕셔너리를 받아서 1차원 배열을 만든다.  
- index, dtype, copy 등의 인자는 넣지 않아도 자동으로 인식되어 처리된다.

In [309]:
import pandas as pd

In [310]:
obj = pd.Series([1,2,3,4])
obj

0    1
1    2
2    3
3    4
dtype: int64

In [311]:
obj.data    #

C:\COSMOS\Anaconda3\envs\pyenv3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Series.data is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

- .data 속성으로 파이썬의 memoryview 클래스의 객체라는 것을 확인할 수가 있다. 
- 즉 값의 위치가 서로 다르다는 것을 알 수가 있는데 
  - 그 내부의 .obj 속성으로 조회하면 생성할 때 입력한 값이 numpy 모듈 배열로 표시된다.  
  - .values로 조회해도 같은 결과를 볼 수가 있다.

In [312]:
obj.data.obj

C:\COSMOS\Anaconda3\envs\pyenv3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Series.data is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

array([1, 2, 3, 4], dtype=int64)

In [313]:
obj.values

array([1, 2, 3, 4], dtype=int64)

- 만들어진 시리즈에서 행(Row)의 레이블을 생성할 때에 지정하지 않았다. 
- .index 속성을 확인해 보았을 경우 안묵적으로 RangeIndex(start=0, stop=4, step=1)의 객체를 만들어서
  행의 레이블을 제공함을 알 수가 있다.  
- Series는 일차원 이므로 
  - 하나의 Datatype만을 가져야 하므로 .dtype 속성을 확인하면 int64로 저장되었슴을 확인가능하다.

In [325]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [326]:
obj.dtype

dtype('int64')

- .dtype 속성에 들어갈 수 있는 자료형을 파이썬의 기본자료형과 비교 
  - 파이썬의 자료형을 사용할 경우 판다스는 object 로 인식 
  - 판다스는 다양한 자료형이 있지만 기본 64bit로 처리 
    - int64 , float64 , datetime64

## 예제 2-6 : 딕셔너리로 시리즈 생성

- 시리즈를 생성할 때에 딕셔너리로 자료를 전달하면 
  - 키는 행(Row)의 레이블로 처리되고 
  - 값은 시리즈의 데이터로 처리되어 명시적으로 레이블을 지정한 것과 같은 결과를 낸다.

- 딕셔너리의 
  - 키 : 문자열 
  - 값 : 정수형 으로 선언하여 Series를 생성한다.

In [327]:
d = {'a':1,'b':2,'c':3}       # dict Type을 입력으로 처리한다.  
ser = pd.Series(d,name='something')

In [328]:
ser

a    1
b    2
c    3
Name: something, dtype: int64

In [329]:
index = ['a','b','c']                               # 이렇게 []로 인덱스를 만들고 
obj1 = pd.Series([1,2,3],index=index,name="test")   # Series를 생성할 때에 매핑을 할 수도 있다.   
obj1

a    1
b    2
c    3
Name: test, dtype: int64

## 예제 2-7 : 넘파이 모듈 이용해서 생성하기

- Numpy의 배열을 활용하여 시리즈 객체를 생성하고 
- 파이썬 리스트, 딕셔너리와의 차이점을 알아본다.

In [333]:
import numpy  as np        # numpy module import 
import pandas as pd        # pandas import 

s = pd.Series(np.random.randn(5))   # numpy의 난수발생기(randn)를 이용하여 5개의 난수를 발생시킴 
s

0   -1.706758
1    0.162910
2    0.348365
3    0.821645
4    0.654041
dtype: float64

- 발생된 난수가 실수형으로 발생되었기 때문에 
- dtype : float64가 되었다.

## 예제 2-8 : 시리즈의 기본 속성 알아보기

- 시리즈는 1차원 배열이므로 shape(모양), ndim(차원) 정보를 가지며 
- 확인하면 행(컬럼)이 4개이고 1차원(ndim=1)으로 생성되었슴을 확인할 수가 있다.

In [334]:
obj = pd.Series([1,2,3,4],name="obj")

In [343]:
obj.shape, obj.ndim

((4,), 1)

In [344]:
id(obj.data.obj)

C:\COSMOS\Anaconda3\envs\pyenv3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Series.data is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

2637360159200

In [345]:
id(obj.values)

2637360159200

In [346]:
obj.blocks

{'int64': 0    1
 1    2
 2    3
 3    4
 Name: obj, dtype: int64}

In [347]:
obj.dtype, obj.itemsize, obj.nbytes

C:\COSMOS\Anaconda3\envs\pyenv3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Series.itemsize is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

(dtype('int64'), 8, 32)

In [348]:
obj.strides

C:\COSMOS\Anaconda3\envs\pyenv3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Series.strides is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

(8,)

In [349]:
obj_emp = pd.Series()

In [350]:
obj_emp.empty

True

## 예제 2-9 : 시리즈로 데이터프레임 생성

In [351]:
s1 = pd.Series([1,2,3,4],name='s1')
s2 = pd.Series(['a','b','c','d'],name='s2')

In [352]:
df = pd.DataFrame({'s1':s1,'s2':s2})

In [353]:
df

   s1 s2
0   1  a
1   2  b
2   3  c
3   4  d

In [354]:
df['s1']

0    1
1    2
2    3
3    4
Name: s1, dtype: int64

In [356]:
s1 == df['s1']

0    True
1    True
2    True
3    True
Name: s1, dtype: bool

In [357]:
df_a = pd.DataFrame([s1,s2])

In [358]:
df_a

    0  1  2  3
s1  1  2  3  4
s2  a  b  c  d

## 예제 2-10 : 딕셔너리가 원소인 딕셔너리로 데이터프레임 생성

In [359]:
data = {'AAA' : {'a' : 4,'b':5, 'c':6, 'd':7}, 
        'BBB' : {'a': 10, 'b' : 20, 'c':30, 'd': 40},
        'CCC' : {'a':100, 'b': 50, 'c': -30, 'd': -50} }

In [360]:
df = pd.DataFrame(data) 
df

   AAA  BBB  CCC
a    4   10  100
b    5   20   50
c    6   30  -30
d    7   40  -50

In [82]:
df2 = pd.DataFrame(data, columns=['AAA','CCC'])

In [83]:
df2

   AAA  CCC
a    4  100
b    5   50
c    6  -30
d    7  -50

## 예제 2-11 : 데이터 프레임의 기본 속성 알아보기

In [361]:
names = ['Bob','Jessica','Mary','John','Mel']
births = [968, 155, 77, 578, 973]
BabyDataSet = list(zip(names,births))

In [362]:
df = pd.DataFrame(data = BabyDataSet, columns=['Names', 'Births'])

In [363]:
df.values

array([['Bob', 968],
       ['Jessica', 155],
       ['Mary', 77],
       ['John', 578],
       ['Mel', 973]], dtype=object)

In [364]:
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['Names', 'Births'], dtype='object')]

In [365]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [366]:
df.columns

Index(['Names', 'Births'], dtype='object')

In [367]:
df.dtypes

Names     object
Births     int64
dtype: object

In [368]:
df.shape, df.ndim, df.size

((5, 2), 2, 10)

## 2.4 인덱스 검색 
- 교재 p60

- 판다스도 인덱스 검색과 슬라이싱을 지원한다.  
- 판다스 인덱스도 
  - __ getitem __ 을 구현하고 이 스페셜 메소드를 확장해 가는 구조이다.  
  - 인덱스 검색을 위한 시리즈는 행(컬럼) 단위로 구성되어 
  - 컬럼을 기준으로 검색을 수행한다.  
- 그러나 데이터 프레임은 열(Row, Index)단위로 구성되어 있으므로 
  - 기본적인 인덱싱을 사용하면 열(Row)단위로 조회가 된다.

## 예제 2-12 데이터를 읽어오기

In [2]:
import pandas as pd 
import numpy  as np

In [3]:
ct = pd.read_csv("../data/2017_college_tuition.csv",encoding='euc-kr')

In [4]:
ct.head()

         학교명 설립구분  평균등록금
0    강릉원주대학교  국공립   4262
1      강원대학교  국공립   4116
2  경남과학기술대학교  국공립   3771
3      경북대학교  국공립   4351
4      경상대학교  국공립   3967

In [5]:
ct.tail()

         학교명 설립구분  평균등록금
191    호남대학교   사립   6482
192  호남신학대학교   사립   6438
193    호서대학교   사립   7695
194    호원대학교   사립   6929
195    홍익대학교   사립   8297

In [6]:
ct.shape     # 파이썬이 tuple 자료형으로 생성됨  
             # 즉 관찰된 값이 고정적이라는 의미

(196, 3)

In [7]:
ct.columns   # 컬럼의 레이블이 한글로 되어 있으므로 
             # .columns 속성으로 확인하면 한글명으로 컬럼의 정보를 관리함을 알 수가 있다.

Index(['학교명', '설립구분', '평균등록금'], dtype='object')

## 예제 2-13 대괄호를 이용한 일반 검색

In [9]:
ct_ser = ct['학교명']     # 일반적인 데이터프레임의 조회방식

In [10]:
ct_ser.head(101)

0        강릉원주대학교
1          강원대학교
2      경남과학기술대학교
3          경북대학교
4          경상대학교
         ...
96         배재대학교
97         백석대학교
98      부산가톨릭대학교
99      부산외국어대학교
100      부산장신대학교
Name: 학교명, Length: 101, dtype: object

In [11]:
ct_ser[100]      # 101번째 레코드 즉 인덱스가 100번인 레코드가 조회  
                 # index를 활용 , 해당 행(row)의 자료가 조회됨

'부산장신대학교'

In [20]:
ct_ser.__getitem__(100)  # 내장 스페셜메소드(__getitem__).(행번호인덱스)를 활용

'부산장신대학교'

In [19]:
ct.__getitem__('학교명').head()      # 컬럼 단위로 조회   
                        # 스페셜 메소드인 __getitem__('컬럼명') : 해당 컬럼이 모두 조회

0      강릉원주대학교
1        강원대학교
2    경남과학기술대학교
3        경북대학교
4        경상대학교
Name: 학교명, dtype: object

## 예제 2-14 대괄호를 이용한 슬라이스 검색

In [12]:
ct_ser.head()       # 주어진 데이타프레임 , label(컬럼명)이 없는 dataframe 
                    # 해당하는 각종 메소드를 활용할 수가 있다.

0      강릉원주대학교
1        강원대학교
2    경남과학기술대학교
3        경북대학교
4        경상대학교
Name: 학교명, dtype: object

In [14]:
ct_ser[10:20]       # ct_ser : dataframe  
                    # index 20에 대한 내용이 조회되지 않음을 알 수가 있다.

10      금오공과대학교
11      대구교육대학교
12        목포대학교
13      목포해양대학교
14        부경대학교
15      부산교육대학교
16        부산대학교
17    서울과학기술대학교
18      서울교육대학교
19        서울대학교
Name: 학교명, dtype: object

In [16]:
ct_slice = ct[10:20]
ct_slice               # 10~19번 행을 가져와서 ct_slice로 복제

          학교명 설립구분  평균등록금
10    금오공과대학교  국공립   3769
11    대구교육대학교  국공립   3604
12      목포대학교  국공립   3895
13    목포해양대학교  국공립   3424
14      부경대학교  국공립   4042
15    부산교육대학교  국공립   3024
16      부산대학교  국공립   4325
17  서울과학기술대학교  국공립   5405
18    서울교육대학교  국공립   3088
19      서울대학교  국공립   5962

In [17]:
ct_slice.head()

        학교명 설립구분  평균등록금
10  금오공과대학교  국공립   3769
11  대구교육대학교  국공립   3604
12    목포대학교  국공립   3895
13  목포해양대학교  국공립   3424
14    부경대학교  국공립   4042

In [18]:
ct_slice.shape       # 10 * 3 matrix

(10, 3)

In [19]:
ct.__getitem__(slice(10,20)).head()  # 위에 작업한 것과 결과가 같이 나온다.

        학교명 설립구분  평균등록금
10  금오공과대학교  국공립   3769
11  대구교육대학교  국공립   3604
12    목포대학교  국공립   3895
13  목포해양대학교  국공립   3424
14    부경대학교  국공립   4042

### 2.4.2 마스킹 검색 
- 교재 P67

- 파이썬에서는 인덱스 검색 연산자의 내부의 값을 다양하게 받아서 처리할 수 있도록 확장했다. 
- 특히 논리식의 결과를 갖고 있는 특정 컬럼의 시리즈 내부 값들이 boolean 인스턴스 값이 True/False로 처리된다.

## 예제 2-15 논리식 검색

In [24]:
sat = pd.read_csv("../data/2014_korea_sat_scores.csv",encoding='euc-kr').dropna(axis=1) 
#  sat

In [25]:
sat.head()

   등급     과목 구분점수  도수(명)  비율(%)
0   1  국어 A형  128  13866   4.30
1   2  국어 A형  123  23599   7.32
2   3  국어 A형  116  42470  13.17
3   4  국어 A형  108  52640  16.32
4   5  국어 A형   97  63896  19.81

In [26]:
sat.shape      # 342 * 5 Matrix

(342, 5)

In [29]:
sat['등급'].dtype        # int64 : 소숫점이 없는 숫자

dtype('int64')

In [30]:
sat['과목'].dtype        # O : Text 형태의 모양

dtype('O')

In [27]:
sat['도수(명)'].dtype    # 도수(명)에 대한 변수를 확인 : 소숫점이 없는 정수

dtype('int64')

In [28]:
sat['구분점수'].dtype    # dtype : O , int64는 아니다. , 한글이 섞여 있으므로 문자형

dtype('O')

In [31]:
sat['비율(%)'].dtype    # 실수형 : 소숫점이 있으므로 실수형

dtype('float64')

In [33]:
sat['도수(명)'] = sat['도수(명)'].astype(np.int64)

In [35]:
sat['도수(명)'].dtype   # 연산을 하기 전에 확실하게 정수형으로 만들어 놓고 연산을 하려ㅕㅕ고

dtype('int64')

In [37]:
(sat['도수(명)'] < 20000).head()   # 결과값이 논리값으로 나왔다. 가부만 판단함

0     True
1    False
2    False
3    False
4    False
Name: 도수(명), dtype: bool

In [39]:
sat[sat['도수(명)'] < 20000].head()  # Index항목에 논리값(논리식의 결과값)을 가져와서
                                    # 판단이 가능하다.

    등급     과목  구분점수  도수(명)  비율(%)
0    1  국어 A형   128  13866   4.30
8    9  국어 A형  60미만  12554   3.89
9    1  국어 B형   127  12615   4.45
16   8  국어 B형    59  19943   7.03
17   9  국어 B형  59미만  10868   3.83

#### 확인사항 
- 데이터 프레임에서 인덱스에 논리식의 결과를 가져와서 활용이 가능하다.  
- 인덱스에 sat['도수(명)'] < 20000 이렇게 논리식을 주었을 경우
  - 해당 결과값이 True인 행(row)만을 가져와서 결과값을 취한다.  
  - 인덱스 값을 판단하였을 때에 True, False가 있는데 그 중에 True만을 결과값으로 취한다.

## 예제 2-16  다중 논리식 검색

- 여러개의 논리식의 결과를 하나로 묶어서 처리도 가능하다.  
- 마스킹 검색에서는 문자도 논리연산자로 사용할 수 없으므로 
  - &(and), |(OR), ~(Not) 기호를 사용하여 처리한다.  
- 논리연산자는 비교연산자보다 우선순위가 낮아서 
  - 논리식을 여러개 작성할 경우 각 논리식을 ()로 묶어서 명확하게 순서를 처리해야 한다.

In [42]:
l_sat = ((sat['도수(명)'] < 20000) & (sat['비율(%)'] <= 5.0))
l_sat.head()   # 결과값의 가부만 확인

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [43]:
l_sat.shape    # 342 행을 갖는다.

(342,)

In [44]:
l_sat.sum()    # True인 레코드가 71건이 나왔다.

71

In [47]:
sat_logic = sat[l_sat]    # l_sat값이 True인 행(도수 < 20,000) AND (비율 < 5.0) : 71건   
sat_logic.head()          # 71건만 추출되어 sal_logic으로

    등급     과목  구분점수  도수(명)  비율(%)
0    1  국어 A형   128  13866   4.30
8    9  국어 A형  60미만  12554   3.89
9    1  국어 B형   127  12615   4.45
17   9  국어 B형  59미만  10868   3.83
18   1  수학 A형   137  19675   4.77

In [48]:
sat_logic.shape

(71, 5)

In [49]:
sat_logic.head()    # 도수가 20,000보다 작고 비율이 5.0봏다 작은 값 
                    # 71건

    등급     과목  구분점수  도수(명)  비율(%)
0    1  국어 A형   128  13866   4.30
8    9  국어 A형  60미만  12554   3.89
9    1  국어 B형   127  12615   4.45
17   9  국어 B형  59미만  10868   3.83
18   1  수학 A형   137  19675   4.77

## 예제 2-17 시리즈에 논리식 검색

In [52]:
sat_ser =  sat['도수(명)'] 
# sat_ser

In [53]:
sat_ser.head()

0    13866
1    23599
2    42470
3    52640
4    63896
Name: 도수(명), dtype: int64

In [54]:
sat_ser[sat_ser < 20000].shape

(294,)

In [55]:
sat_ser[sat_ser < 20000].head()

0     13866
8     12554
9     12615
16    19943
17    10868
Name: 도수(명), dtype: int64

## 예제 2-18 데이터 프레임 팬시검색

### Seaborn에 관하여     
- seaborn은 matplotlib의 상위 호환 데이터 시각화를 위한 라이브러리이다.  
- 데이터프레임으로 다양한 통계 지표를 낼 수 있는 시각화 차트를 제공하기 때문에 
- 데이터 분석에 활발히 사용되고 있는 라이브러리입니다. 
- 개념설명 참고자료 : https://pinkwink.kr/955  
- 시각화 활용예 : 시각화 설명 : https://datascienceschool.net/view-notebook/4c2d5ff1caab4b21a708cc662137bc65/  

- 활용 예 : https://teddylee777.github.io/visualization/seaborn-tutorial-1 (관련 참조요망)

In [409]:
!pip install seaborn

Requirement already satisfied: seaborn in c:\cosmos\anaconda3\envs\pyenv3\lib\site-packages (0.10.1)
Requirement already satisfied: scipy>=1.0.1 in c:\cosmos\anaconda3\envs\pyenv3\lib\site-packages (from seaborn) (1.5.0)
Requirement already satisfied: pandas>=0.22.0 in c:\cosmos\anaconda3\envs\pyenv3\lib\site-packages (from seaborn) (0.25.1)
Requirement already satisfied: matplotlib>=2.1.2 in c:\cosmos\anaconda3\envs\pyenv3\lib\site-packages (from seaborn) (3.1.2)
Requirement already satisfied: numpy>=1.13.3 in c:\cosmos\anaconda3\envs\pyenv3\lib\site-packages (from seaborn) (1.18.0)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\cosmos\anaconda3\envs\pyenv3\lib\site-packages (from pandas>=0.22.0->seaborn) (2.8.0)
Requirement already satisfied: pytz>=2017.2 in c:\cosmos\anaconda3\envs\pyenv3\lib\site-packages (from pandas>=0.22.0->seaborn) (2019.1)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 in c:\cosmos\anaconda3\envs\pyenv3\lib\site-packages (from matplotlib>=2.1.2->seaborn) (2.4.0)
Requirement already satisfied: cycler>=0.10 in c:\cosmos\anaconda3\envs\pyenv3\lib\site-packages (from matplotlib>=2.1.2->seaborn) (0.10.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\cosmos\anaconda3\envs\pyenv3\lib\site-packages (from matplotlib>=2.1.2->seaborn) (1.1.0)
Requirement already satisfied: six>=1.5 in c:\cosmos\anaconda3\envs\pyenv3\lib\site-packages (from python-dateutil>=2.6.1->pandas>=0.22.0->seaborn) (1.12.0)
Requirement already satisfied: setuptools in c:\cosmos\anaconda3\envs\pyenv3\lib\site-packages (from kiwisolver>=1.0.1->matplotlib>=2.1.2->seaborn) (41.0.1)

In [56]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [107]:
# 한글 폰트 적용
plt.rc('font', family='NanumBarunGothic') 
# 캔버스 사이즈 적용
plt.rcParams["figure.figsize"] = (12, 9)

In [60]:
titanic = sns.load_dataset('titanic')      # Seaborn의 기본적인 예제  
                                           #

In [61]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [62]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [63]:
titanic[ ['age','sex','alive']] .head()

    age     sex alive
0  22.0    male    no
1  38.0  female   yes
2  26.0  female   yes
3  35.0  female   yes
4  35.0    male    no

In [64]:
titanic[ ['age','sex','alive']].isnull().sum()

age      177
sex        0
alive      0
dtype: int64

In [65]:
titanic[ ['age']].head()

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [66]:
titanic['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

## 예제 2-19 시리즈 팬시검색

In [67]:
titanic_age = titanic['age']

In [68]:
titanic_age[[0,3,4]]

0    22.0
3    35.0
4    35.0
Name: age, dtype: float64

## 예제 2-20 명시적 인덱서 검색

In [69]:
import seaborn as sns

In [70]:
diamonds = sns.load_dataset('diamonds')

In [71]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [72]:
diamonds.shape

(53940, 10)

In [73]:
diamonds.isnull().sum()

carat      0
cut        0
color      0
clarity    0
depth      0
table      0
price      0
x          0
y          0
z          0
dtype: int64

In [74]:
type(diamonds.loc)

pandas.core.indexing._LocIndexer

In [75]:
diamonds.loc[0]

carat       0.23
cut        Ideal
color          E
clarity      SI2
depth       61.5
table         55
price        326
x           3.95
y           3.98
z           2.43
Name: 0, dtype: object

In [76]:
diamonds.loc[0, 'carat']

0.23

In [77]:
diamonds.loc[:, 'carat'].head()

0    0.23
1    0.21
2    0.23
3    0.29
4    0.31
Name: carat, dtype: float64

In [78]:
diamonds['carat'].head()

0    0.23
1    0.21
2    0.23
3    0.29
4    0.31
Name: carat, dtype: float64

In [79]:
diamonds.loc[:, ['carat']].head()

   carat
0   0.23
1   0.21
2   0.23
3   0.29
4   0.31

In [80]:
diamonds[['carat']].head()

   carat
0   0.23
1   0.21
2   0.23
3   0.29
4   0.31

In [81]:
diamonds.xs(0)

carat       0.23
cut        Ideal
color          E
clarity      SI2
depth       61.5
table         55
price        326
x           3.95
y           3.98
z           2.43
Name: 0, dtype: object

In [82]:
diamonds.xs("carat",1).head()

0    0.23
1    0.21
2    0.23
3    0.29
4    0.31
Name: carat, dtype: float64

In [83]:
diamonds.lookup([0,1],['carat','cut'])

array([0.23, 'Premium'], dtype=object)

## 예제 2-21 암묵적 인덱서  검색

In [84]:
diamonds.iloc[0]

carat       0.23
cut        Ideal
color          E
clarity      SI2
depth       61.5
table         55
price        326
x           3.95
y           3.98
z           2.43
Name: 0, dtype: object

In [85]:
diamonds.iloc[0,0]

0.23

In [86]:
diamonds.iloc[0,[0]]

carat    0.23
Name: 0, dtype: object

In [87]:
diamonds.iloc[0,[0,1,2]]

carat     0.23
cut      Ideal
color        E
Name: 0, dtype: object

In [88]:
diamonds.iloc[:5, :3]

   carat      cut color
0   0.23    Ideal     E
1   0.21  Premium     E
2   0.23     Good     E
3   0.29  Premium     I
4   0.31     Good     J

## 예제 2-22 명시적 인덱서 복합 검색

In [89]:
diamonds.columns

Index(['carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price', 'x', 'y',
       'z'],
      dtype='object')

In [90]:
((diamonds['carat']== 0.23) &(diamonds['cut'] == 'Very Good')).head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [91]:
carat_cut = diamonds.loc[((diamonds['carat']== 0.23) & 
              (diamonds['cut'] == 'Very Good')), 
             ['carat', 'cut','color','price']]

In [92]:
carat_cut.shape

(197, 4)

In [93]:
carat_cut.head()

    carat        cut color  price
9    0.23  Very Good     H    338
21   0.23  Very Good     E    352
22   0.23  Very Good     H    353
25   0.23  Very Good     G    354
28   0.23  Very Good     D    357

In [94]:
diamonds.loc[:,['carat', 'cut','color','price']].head()

   carat      cut color  price
0   0.23    Ideal     E    326
1   0.21  Premium     E    326
2   0.23     Good     E    327
3   0.29  Premium     I    334
4   0.31     Good     J    335

In [95]:
diamonds.loc._get_slice_axis(slice(0,len(diamonds)),0).head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [96]:
abc = diamonds.loc._get_slice_axis(slice(0,len(diamonds)),0)
abc.__getitem__(['carat', 'cut','color','price']).head()

   carat      cut color  price
0   0.23    Ideal     E    326
1   0.21  Premium     E    326
2   0.23     Good     E    327
3   0.29  Premium     I    334
4   0.31     Good     J    335

## 예제 2-23 문자열 값 순서 검색

In [97]:
set_i = diamonds.set_index('color')

In [98]:
set_i.head()

       carat      cut clarity  depth  table  price     x     y     z
color
E       0.23    Ideal     SI2   61.5   55.0    326  3.95  3.98  2.43
E       0.21  Premium     SI1   59.8   61.0    326  3.89  3.84  2.31
E       0.23     Good     VS1   56.9   65.0    327  4.05  4.07  2.31
I       0.29  Premium     VS2   62.4   58.0    334  4.20  4.23  2.63
J       0.31     Good     SI2   63.3   58.0    335  4.34  4.35  2.75

In [99]:
try :
    set_i.loc['E':'F']
except ValueError as e :
    print('ValueError', e)
except KeyError as e :
    print(' KeyError', e)

 KeyError "Cannot get left slice bound for non-unique label: 'E'"

In [100]:
set_i.sort_index(inplace=True)

In [101]:
try :
    set_i_str = set_i.loc['E':'F']
except ValueError as e :
    print('ValueError', e)
except KeyError as e :
    print(' KeyError', e)

In [102]:
set_i_str.shape

(19339, 9)

In [103]:
set_i_str.head()

       carat        cut clarity  depth  table  price     x     y     z
color
E       2.01      Ideal     SI2   62.2   57.0  17849  8.09  8.04  5.02
E       1.51  Very Good    VVS2   60.2   61.0  17689  7.34  7.40  4.44
E       0.50      Ideal    VVS2   61.5   57.0   2236  5.09  5.12  3.14
E       1.13      Ideal    VVS1   60.6   57.0  14525  6.72  6.77  4.09
E       1.51      Ideal     VS2   62.7   57.0  14482  7.31  7.26  4.57

In [104]:
set_i_str.tail()

       carat      cut clarity  depth  table  price     x     y     z
color
F       1.01    Ideal     VS1   62.5   54.0   7602  6.46  6.43  4.03
F       1.01  Premium     VS1   62.5   58.0   7602  6.42  6.37  4.00
F       1.05    Ideal     VS2   59.1   57.0   7697  6.67  6.66  3.94
F       1.01     Good     VS2   57.3   62.0   5487  6.63  6.59  3.79
F       1.52    Ideal     SI1   62.0   54.0  12071  7.36  7.44  4.59

## 예제 2-24 데이터프레임 칼럼 추가

In [105]:
import pandas as pd

In [106]:
movies = pd.read_csv("../data/movies.csv",usecols = ['Film','Year'])

In [459]:
movies.head()

                                 Film  Year
0          Zack and Miri Make a Porno  2008
1                     Youth in Revolt  2010
2  You Will Meet a Tall Dark Stranger  2010
3                        When in Rome  2010
4               What Happens in Vegas  2008

In [460]:
movies_add  = pd.read_csv("../data/movies.csv")

In [461]:
movies_add.head()

,Film,Genre,Lead Studio,Audience score %,Profitability,Rotten Tomatoes %,Worldwide Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008

In [462]:
movies['has_seen'] = 0

In [463]:
movies.head()

                                 Film  Year  has_seen
0          Zack and Miri Make a Porno  2008         0
1                     Youth in Revolt  2010         0
2  You Will Meet a Tall Dark Stranger  2010         0
3                        When in Rome  2010         0
4               What Happens in Vegas  2008         0

In [464]:
movies_add.columns

Index(['Film', 'Genre', 'Lead Studio', 'Audience score %', 'Profitability',
       'Rotten Tomatoes %', 'Worldwide Gross', 'Year'],
      dtype='object')

In [465]:
movies['has_seen'] = (movies_add['Audience score %'] + movies_add['Rotten Tomatoes %'])// 2

In [466]:
movies.head()

                                 Film  Year  has_seen
0          Zack and Miri Make a Porno  2008        67
1                     Youth in Revolt  2010        60
2  You Will Meet a Tall Dark Stranger  2010        39
3                        When in Rome  2010        29
4               What Happens in Vegas  2008        50

In [467]:
movies['has_seen'].isnull().sum()

0

In [468]:
movies_add['Worldwide Gross'].dtype

dtype('O')

In [469]:
d = movies_add['Worldwide Gross'].str.replace('$','').astype('float64')

In [470]:
movies.columns.get_loc('has_seen')

2

In [471]:
movies.insert(movies.columns.get_loc('has_seen')+1, "원화환산", d * 1200)

In [472]:
movies.head()

                                 Film  Year  has_seen      원화환산
0          Zack and Miri Make a Porno  2008        67   50328.0
1                     Youth in Revolt  2010        60   23544.0
2  You Will Meet a Tall Dark Stranger  2010        39   31992.0
3                        When in Rome  2010        29   51648.0
4               What Happens in Vegas  2008        50  263244.0

## 예제 2-25 시리즈와 데이터프레임 내의 특정 원소 변경

In [473]:
movies.loc[74,'has_seen']

84

In [474]:
import numpy as np

In [475]:
movies.loc[74,'has_seen'] = np.nan

In [476]:
movies.loc[74,'has_seen']

nan

In [477]:
movies['has_seen'].isnull().sum()

1

In [478]:
movies.columns    # 컬럼의 Label을 검색

Index(['Film', 'Year', 'has_seen', '원화환산'], dtype='object')

In [479]:
movies_ser_at = movies['Year']
movies_ser_at.head()

0    2008
1    2010
2    2010
3    2010
4    2008
Name: Year, dtype: int64

In [480]:
movies_ser_at.put(0,2024)

C:\COSMOS\Anaconda3\envs\pyenv3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: `put` has been deprecated and will be removed in afuture version.
  """Entry point for launching an IPython kernel.

In [481]:
movies_ser_at.get(0)

2024

In [482]:
movies_ser_at.head()

0    2024
1    2010
2    2010
3    2010
4    2008
Name: Year, dtype: int64

## 예제 2-26 시리즈와 데이터프레임의 행과 열 삭제

In [483]:
movies_del =  pd.read_csv("../data/movies.csv")

In [484]:
movies_del.shape

(77, 8)

In [485]:
movies_del.columns

Index(['Film', 'Genre', 'Lead Studio', 'Audience score %', 'Profitability',
       'Rotten Tomatoes %', 'Worldwide Gross', 'Year'],
      dtype='object')

In [486]:
movies_del1 = movies_del.drop('Rotten Tomatoes %', axis=1)  # 특 정 컬럼 삭제

In [487]:
movies_del1.head()

,Film,Genre,Lead Studio,Audience score %,Profitability,Worldwide Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,$41.94,2008
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,$19.62,2010
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,$26.66,2010
3,When in Rome,Comedy,Disney,44,0.000000,$43.04,2010
4,What Happens in Vegas,Comedy,Fox,72,6.267647,$219.37,2008

In [488]:
movies_del1.shape

(77, 7)

In [489]:
movies_del2 = movies_del.drop([1,2,3,4], axis=0)  # 4개의 레코드 삭제

In [490]:
movies_del2.shape

(73, 8)

In [491]:
movies_del2.head()     # 1~4번 행이 삭제된 것을 확인할 수가 있다.

,Film,Genre,Lead Studio,Audience score %,Profitability,Rotten Tomatoes %,Worldwide Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008
5,Water For Elephants,Drama,20th Century Fox,72,3.081421,60,$117.09,2011
6,WALL-E,Animation,Disney,89,2.896019,96,$521.28,2008
7,Waitress,Romance,Independent,67,11.089741,89,$22.18,2007
8,Waiting For Forever,Romance,Independent,53,0.005000,6,$0.03,2011

In [492]:
movies_del.shape   # 원형은 그대로 있다.  삭제되지 않았다.

(77, 8)

In [493]:
movies_del3 = movies_del.drop(['Lead Studio','Worldwide Gross'], axis=1)  # 특정 컬럼 삭제

In [494]:
movies_del3.shape

(77, 6)

In [495]:
movies_del3.head()

,Film,Genre,Audience score %,Profitability,Rotten Tomatoes %,Year
0,Zack and Miri Make a Porno,Romance,70,1.747542,64,2008
1,Youth in Revolt,Comedy,52,1.090000,68,2010
2,You Will Meet a Tall Dark Stranger,Comedy,35,1.211818,43,2010
3,When in Rome,Comedy,44,0.000000,15,2010
4,What Happens in Vegas,Comedy,72,6.267647,28,2008

In [496]:
movies_del.drop(['Lead Studio','Worldwide Gross'], axis=1, inplace=True)

In [497]:
movies_del.head()

,Film,Genre,Audience score %,Profitability,Rotten Tomatoes %,Year
0,Zack and Miri Make a Porno,Romance,70,1.747542,64,2008
1,Youth in Revolt,Comedy,52,1.090000,68,2010
2,You Will Meet a Tall Dark Stranger,Comedy,35,1.211818,43,2010
3,When in Rome,Comedy,44,0.000000,15,2010
4,What Happens in Vegas,Comedy,72,6.267647,28,2008

In [498]:
movies_ser = movies_del['Genre']   # 쟝르만 가져와서 별도의 데이터프레임으로 생성

In [499]:
movies_ser.head()

0    Romance
1     Comedy
2     Comedy
3     Comedy
4     Comedy
Name: Genre, dtype: object

In [500]:
movies_ser.drop([1,2,3,4],inplace=True)

In [501]:
movies_ser.head()

0      Romance
5        Drama
6    Animation
7      Romance
8      Romance
Name: Genre, dtype: object

## 예제 2-27 문자열 조회

In [502]:
movies_str =  pd.read_csv("../data/korea_movie_list.csv", engine="python")
movies_str.head()

,movie_code,title,title_Eng,show_time,produce_year,open_date,produce_state,type,nation,genre,director,actor,show_type,watch_grade
0,20185801,할로우 차일드,The Hollow Child,88.0,2017,20180802,개봉예정,장편,캐나다,공포(호러)/판타지,제레미 루터,NaN,NaN,15세이상관람가
1,20187649,죽음의 리무진,Glass Coffin,75.0,2016,20180816,개봉예정,장편,스페인,스릴러/공포(호러),하리츠 쥬빌라가,파울라 본템피,NaN,NaN
2,20187641,극장판 도라에몽: 진구의 보물섬,NaN,107.0,2018,20180815,개봉예정,장편,일본,애니메이션/SF/어드벤처,이마이 카즈아키,윤아영/김정아/조현정/최낙윤/이현주/임은정/김정은/이지현/이경태/강은애/박성영/이다...,"2D,디지털더빙",전체관람가
3,20187427,명탐정 코난 : 제로의 집행인,Detective Conan: Zero the Enforcer,110.0,2018,20180808,개봉예정,장편,일본,애니메이션,타치카와 유즈루,타카야마 미나미/야마자키 와카나/코야마 리키야/푸루야 토루,"2D,디지털/2D,디지털더빙",12세이상관람가
4,20173732,살아남은 아이,Last Child,123.0,2017,20180830,개봉예정,장편,한국,드라마,신동석,최무성/김여진/성유빈,"2D,디지털",NaN

In [503]:
movies_str.columns

Index(['movie_code', 'title', 'title_Eng', 'show_time', 'produce_year',
       'open_date', 'produce_state', 'type', 'nation', 'genre', 'director',
       'actor', 'show_type', 'watch_grade'],
      dtype='object')

In [504]:
movies_str.shape

(2827, 14)

In [505]:
movies_str.head(2)

,movie_code,title,title_Eng,show_time,produce_year,open_date,produce_state,type,nation,genre,director,actor,show_type,watch_grade
0,20185801,할로우 차일드,The Hollow Child,88.0,2017,20180802,개봉예정,장편,캐나다,공포(호러)/판타지,제레미 루터,NaN,NaN,15세이상관람가
1,20187649,죽음의 리무진,Glass Coffin,75.0,2016,20180816,개봉예정,장편,스페인,스릴러/공포(호러),하리츠 쥬빌라가,파울라 본템피,NaN,NaN

In [506]:
movies_str_ser = movies_str['title']

In [507]:
movies_str_eng = movies_str['title_Eng']

In [508]:
movies_str_eng.head()

0                      The Hollow Child
1                          Glass Coffin
2                                   NaN
3    Detective Conan: Zero the Enforcer
4                            Last Child
Name: title_Eng, dtype: object

In [509]:
movies_str_ser.hasnans

False

In [510]:
movies_str_eng.hasnans

True

In [511]:
movies_str_eng= movies_str_eng.dropna()

In [512]:
movies_str_eng.shape

(2226,)

In [513]:
s = str("가을")
s

'가을'

In [514]:
len(s)

2

In [515]:
movies_str_ser.str.len().head()

0     7
1     7
2    17
3    16
4     7
Name: title, dtype: int64

In [516]:
s.find("을")

1

In [517]:
movies_str_ser.str.find('할로우').head()

0    0
1   -1
2   -1
3   -1
4   -1
Name: title, dtype: int64

In [518]:
s.count("을")

1

In [519]:
movies_str_ser.str.count('의').head()

0    0
1    1
2    1
3    1
4    0
Name: title, dtype: int64

## 예제 2-28 문자열 변경

In [520]:
si = str(' 찬혁 ')

In [521]:
si

' 찬혁 '

In [522]:
len(si)

4

In [523]:
si = si.strip()

In [524]:
len(si)

2

In [525]:
idx = pd.Index([' 찬혁', '런던 ', ' 소셜 ', '겨울'])
idx

Index([' 찬혁', '런던 ', ' 소셜 ', '겨울'], dtype='object')

In [526]:
idx.str.strip()   # 양쪽 공백을 제거 
idx

Index([' 찬혁', '런던 ', ' 소셜 ', '겨울'], dtype='object')

In [527]:
idx.str.rstrip()  # 우측 공백을 제거 
idx

Index([' 찬혁', '런던 ', ' 소셜 ', '겨울'], dtype='object')

In [528]:
import numpy as np

In [529]:
ss = pd.Series(['가_나_다', '라_마_바', np.nan, '사_아_자'])
ss

0    가_나_다
1    라_마_바
2      NaN
3    사_아_자
dtype: object

In [530]:
ss.str.split('_') 
ss

0    가_나_다
1    라_마_바
2      NaN
3    사_아_자
dtype: object

In [531]:
ss.str.split('_').str.get(1)

0      나
1      마
2    NaN
3      아
dtype: object

In [532]:
ss.str.split('_').str[1]

0      나
1      마
2    NaN
3      아
dtype: object

In [533]:
ss.str.split('_', expand=True)

     0    1    2
0    가    나    다
1    라    마    바
2  NaN  NaN  NaN
3    사    아    자

In [534]:
ss.str.split('_', expand=True, n=1)

     0    1
0    가  나_다
1    라  마_바
2  NaN  NaN
3    사  아_자

In [535]:
ss.str.rsplit('_', expand=True, n=1)

     0    1
0  가_나    다
1  라_마    바
2  NaN  NaN
3  사_아    자

In [536]:
ss.str.replace("_", "%")

0    가%나%다
1    라%마%바
2      NaN
3    사%아%자
dtype: object

In [537]:
ss.str.cat(sep=',')

'가_나_다,라_마_바,사_아_자'

In [538]:
ss.str.cat()

'가_나_다라_마_바사_아_자'

In [539]:
ss.str.cat(['A', 'B', 'C', 'D'])

0    가_나_다A
1    라_마_바B
2       NaN
3    사_아_자D
dtype: object

In [540]:
su = pd.Series(['A', 'B', 'C', 'D'])
su

0    A
1    B
2    C
3    D
dtype: object

In [541]:
ss.str.cat(su)

0    가_나_다A
1    라_마_바B
2       NaN
3    사_아_자D
dtype: object

In [542]:
ss.str[0]

0      가
1      라
2    NaN
3      사
dtype: object

In [543]:
ss.str[1]

0      _
1      _
2    NaN
3      _
dtype: object

In [544]:
ss.str[2]

0      나
1      마
2    NaN
3      아
dtype: object